dave1b/Micro-C/SW07ADC/board/pin_mux.c
    /* PORTB20 (pin F10) is configured as PTB20 */
    PORT_SetPinMux(LED_RED_R_L_BREAK_PORT, LED_RED_R_L_BREAK_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin C6) is configured as PTC10 */
    PORT_SetPinMux(LED_BLUE_F_L_PORT, LED_BLUE_F_L_PIN, kPORT_MuxAsGpio);

    /* PORTC11 (pin C5) is configured as PTC11 */
    PORT_SetPinMux(LED_GREEN_F_R_PORT, LED_GREEN_F_R_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin A7) is configured as PTC8 */
    PORT_SetPinMux(LED_GREEN_F_L_PORT, LED_GREEN_F_L_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin D6) is configured as PTC9 */
    PORT_SetPinMux(LED_RED_F_L_PORT, LED_RED_F_L_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin C3) is configured as PTD2 */
    PORT_SetPinMux(LED_RED_F_R_PORT, LED_RED_F_R_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin B3) is configured as PTD3 */
    PORT_SetPinMux(LED_BLUE_F_R_PORT, LED_BLUE_F_R_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
JOYSTICK:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: G11, peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA, direction: INPUT, pull_select: up}
  - {pin_num: G10, peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM1_QD_PHB, direction: INPUT, pull_select: up}
  - {pin_num: G9, peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, direction: INPUT, pull_select: up}
  - {pin_num: E10, peripheral: GPIOB, signal: 'GPIO, 9', pin_signal: PTB9/SPI1_PCS1/LPUART0_CTS_b/FB_AD20, identifier: LEFT, direction: INPUT, pull_select: up}
  - {pin_num: G8, peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, direction: INPUT, pull_select: up}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : JOYSTICK
 * Description   : All joystick input pins
 *
 * END ****************************************************************************************************************/
void JOYSTICK(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t RIGHT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin G11)  */
    GPIO_PinInit(JOYSTICK_RIGHT_GPIO, JOYSTICK_RIGHT_PIN, &RIGHT_config);

    gpio_pin_config_t DOWN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin G10)  */
    GPIO_PinInit(JOYSTICK_DOWN_GPIO, JOYSTICK_DOWN_PIN, &DOWN_config);

    gpio_pin_config_t UP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin G9)  */
    GPIO_PinInit(JOYSTICK_UP_GPIO, JOYSTICK_UP_PIN, &UP_config);

    gpio_pin_config_t PUSH_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin G8)  */
    GPIO_PinInit(JOYSTICK_PUSH_GPIO, JOYSTICK_PUSH_PIN, &PUSH_config);

    gpio_pin_config_t LEFT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin E10)  */
    GPIO_PinInit(JOYSTICK_LEFT_GPIO, JOYSTICK_LEFT_PIN, &LEFT_config);

    /* PORTB0 (pin G11) is configured as PTB0 */
    PORT_SetPinMux(JOYSTICK_RIGHT_PORT, JOYSTICK_RIGHT_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB1 (pin G10) is configured as PTB1 */
    PORT_SetPinMux(JOYSTICK_DOWN_PORT, JOYSTICK_DOWN_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[1] = ((PORTB->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB2 (pin G9) is configured as PTB2 */
    PORT_SetPinMux(JOYSTICK_UP_PORT, JOYSTICK_UP_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[2] = ((PORTB->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB3 (pin G8) is configured as PTB3 */
    PORT_SetPinMux(JOYSTICK_PUSH_PORT, JOYSTICK_PUSH_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB9 (pin E10) is configured as PTB9 */
    PORT_SetPinMux(JOYSTICK_LEFT_PORT, JOYSTICK_LEFT_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
ADC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L2, peripheral: ADC1, signal: 'SE, 19', pin_signal: ADC1_DM0/ADC0_DM3}
  - {pin_num: L1, peripheral: ADC1, signal: 'SE, 0', pin_signal: ADC1_DP0/ADC0_DP3}
  - {peripheral: ADC1, signal: 'SE, 26', pin_signal: TempSensor}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ADC(void)
{
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
